---
kind: type
id: T:Autodesk.Revit.DB.IFCExportElementType
source: html/981a88ab-534d-edac-94a1-ab8e790d1712.htm
---
# Autodesk.Revit.DB.IFCExportElementType

An enumerated type defining if an element type is exported to IFC or not.

## Syntax (C#)
```csharp
public enum IFCExportElementType
```